package enum

// 错误码规则:
// (1) 错误码需为 > 0 的数;
//
// (2) 错误码为 5 位数:
//
//	----------------------------------------------------------
//	    第1位               2、3位                  4、5位
//	----------------------------------------------------------
//	  服务级错误码          模块级错误码	         具体错误码
//	----------------------------------------------------------
type Code uint32

var (
	// OK
	OK               Code = 200 // 成功
	Error            Code = 500 // 错误
	NoAuthentication Code = 403 // 未鉴权
	NetWorkError     Code = 501 // 网络错误

	// ......
)
